Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СписаниеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИзделий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура УбратьДругиеТипыНаСервере()
	ТЗ = Объект.Товары.Выгрузить();
	ТЗ.Колонки.Добавить("ТипНоменклатуры");
	Для каждого СтрокаТЗ из ТЗ Цикл
		СтрокаТЗ.ТипНоменклатуры = СтрокаТЗ.Номенклатура.Тип;
	КонецЦикла;
	ПараметрыОтбора = Новый Структура("ТипНоменклатуры",Объект.ТипНоменклатуры);    
    ТЗНов = ТЗ.Скопировать(ПараметрыОтбора); 
	ТЗНов.Колонки.Удалить("ТипНоменклатуры");
	Объект.Товары.Очистить();
	Объект.Товары.Загрузить(ТЗНов);

КонецПроцедуры

&НаКлиенте
Процедура УбратьДругиеТипы(Команда)
	УбратьДругиеТипыНаСервере();
КонецПроцедуры
